Котельников_АБ_70153995/src/Catalogs/Кандидаты/Кандидаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Кандидаты</name>
  <attributes>
    <name>ЭтапПодбора</name>
    <type>
      <types>EnumRef.ЭтапыПодбора</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказа</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаВакансию</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВакансии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПривлечения</name>
    <type>
      <types>CatalogRef.ИсточникиПривлечения</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Города</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияМетро</name>
    <type>
      <types>CatalogRef.СтанцииМетро</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Возраст</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Эмаил</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Образование</name>
    <type>
      <types>EnumRef.УровниОбразования</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДолжность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖелательноеВремяДоРаботы</name>
    <type>
      <types>EnumRef.ВариантыДоступностиМестаРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяЗарплата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеТекстаОКандидате</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияРезюме</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоОбновленияРезюме</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФотоКандидата</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийОпытВГодах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийОпытВМесяцах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаСкачиваниеРезюмеХХ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаРезюме</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНаСайтеУниверситета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткликОтКандидата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРезюмеХХ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КомментарииКПоЭтапам</name>
    <attributes>
      <name>ДатаКомментария</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>EnumRef.ЭтапыПодбора</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОпытРаботы</name>
    <attributes>
      <name>РасположениеОрганизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеОрганизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СайтКомпании</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтрасльКомпании</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоРаботы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеРаботы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗнанияЯзыков</name>
    <attributes>
      <name>Язык</name>
      <type>
        <types>String</types>
        <types>CatalogRef.Языки</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УровеньВладения</name>
      <type>
        <types>EnumRef.УровниЗнанийЯзыков</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодходящиеГрафикиРаботы</name>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>EnumRef.ГрафикиРаботы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодходящиеТипыЗанятости</name>
    <attributes>
      <name>ТипЗанятости</name>
      <type>
        <types>EnumRef.ТипыЗанятости</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КлючевыеНавыки</name>
    <attributes>
      <name>Навык</name>
      <type>
        <types>CatalogRef.КлючевыеНавыки</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КурсыПовышенияКвалификации</name>
    <attributes>
      <name>НазваниеКурсаТеста</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпециальностьСпециализация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГодОкончания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПройденныеТестыИлиЭкзамены</name>
    <attributes>
      <name>НазваниеКурсаТеста</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпециальностьСпециализация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГодОкончания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбразованиеВышеСреднего</name>
    <attributes>
      <name>УровеньОбразования</name>
      <type>
        <types>EnumRef.УровниОбразования</types>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеУчебногоЗаведения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факультет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпециальностьСпециализация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АкронимУчебногоЗаведения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГодОкончания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СреднееОбразование</name>
    <attributes>
      <name>НазваниеУчебногоЗаведения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГодОкончания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Котельников_АБ_70153995/src/Catalogs/Кандидаты/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено И ДанныеЗаполнения.ИсточникЗаполнения = "ПоискИПросмотрРезюмеХХ" Тогда 			
		ЗаполнениеМестаПроживания(ДанныеЗаполнения);				
		ЗаполнениеУровняОбразования(ДанныеЗаполнения);		
		ЗаполнениеТЧОпытРаботы(ДанныеЗаполнения);		
		ЗаполнениеТЧЗнанияЯзыков(ДанныеЗаполнения);
		ЗаполнениеТЧПодходящиеГрафикиРаботы(ДанныеЗаполнения);
		ЗаполнениеТЧПодходящиеТипыЗанятости(ДанныеЗаполнения);
		ЗаполнениеТЧКлючевыеНавыки(ДанныеЗаполнения);
		ЗаполнениеДанныхОбОбразовании(ДанныеЗаполнения);
	ИначеЕсли ДанныеЗаполнения <> Неопределено И ДанныеЗаполнения.ИсточникЗаполнения = "ЗагрузкаОткликовССайтаУниверситета" Тогда
		ЗаполнениеДанныхКандидатаССайта(ДанныеЗаполнения);	
	КонецЕсли;
	         
КонецПроцедуры  

Процедура ЗаполнениеМестаПроживания(ДанныеЗаполнения)
	
	Если ДанныеЗаполнения.ГородПроживания <> Неопределено Тогда
		СсылкаНаГород = Справочники.Города.НайтиПоРеквизиту("ИдентификаторГородаХХ", ДанныеЗаполнения.ГородПроживания["id"]);
		Если НЕ СсылкаНаГород.Пустая() Тогда
			Город = СсылкаНаГород;
			Регион = Город.Родитель.Наименование;
		Иначе
			Город = ДанныеЗаполнения.ГородПроживания["name"]; 	
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

Процедура ЗаполнениеУровняОбразования(ДанныеЗаполнения)	
	
	Образование = Перечисления.УровниОбразования[СтрЗаменить(ТРег(ДанныеЗаполнения.УровеньОбразованияКандидата["name"])," ","")]
	
КонецПроцедуры

Процедура ЗаполнениеТЧОпытРаботы(ДанныеЗаполнения)

	ОпытРаботыВОрганизациях = ДанныеЗаполнения.ОпытРаботы; 
	
	Для Каждого Опыт Из ОпытРаботыВОрганизациях Цикл
		СтрокаТЧ = ОпытРаботы.Добавить();
		
		Если Опыт["area"] <> Неопределено Тогда 
			СтрокаТЧ.РасположениеОрганизации = Опыт["area"]["name"];
		КонецЕсли; 
		
		СтрокаТЧ.НазваниеОрганизации = Опыт["company"];
		СтрокаТЧ.СайтКомпании = Опыт["company_url"];
		
		Если Опыт["industry"] <> Неопределено Тогда
			СтрокаТЧ.ОтрасльКомпании = Опыт["industry"]["name"];
		КонецЕсли;
                                  
		СтрокаТЧ.НачалоРаботы = Дата(СтрЗаменить(Сред(Опыт["start"], 0, 10), "-", ""));
		
		Если Опыт["end"] <> Неопределено Тогда
			СтрокаТЧ.ОкончаниеРаботы = Дата(СтрЗаменить(Сред(Опыт["end"], 0, 10), "-", ""));
		КонецЕсли;
		
		СтрокаТЧ.Должность = Опыт["position"];		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнениеТЧЗнанияЯзыков(ДанныеЗаполнения)
	
	СписокЯзыков = ДанныеЗаполнения.ЗнанияЯзыков;	
	Для Каждого Язык Из СписокЯзыков Цикл		
		СсылкаНаЯзык = Справочники.Языки.НайтиПоНаименованию(Язык["name"]);	
		СтрокаТЧ = ЗнанияЯзыков.Добавить(); 
		Если НЕ СсылкаНаЯзык.Пустая() Тогда
			СтрокаТЧ.Язык = СсылкаНаЯзык;
		Иначе
			СтрокаТЧ.Язык = Язык["name"];
		КонецЕсли;
				
		УровеньВладения = Язык["level"]["name"];
		Для каждого ТекЭлемент Из Метаданные.Перечисления["УровниЗнанийЯзыков"].ЗначенияПеречисления  Цикл
			Если ТекЭлемент.Синоним = УровеньВладения Тогда
				СтрокаТЧ.УровеньВладения = Перечисления["УровниЗнанийЯзыков"][ТекЭлемент.Имя];
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнениеТЧПодходящиеГрафикиРаботы(ДанныеЗаполнения)

	СписокПодходящихГрафиков = ДанныеЗаполнения.ПодходящиеГрафикиРаботы;
	
	Для Каждого График Из СписокПодходящихГрафиков Цикл
		СтрокаТЧ = ПодходящиеГрафикиРаботы.Добавить();
		ПодходящийГрафикРаботы = График["name"];
		Для каждого ТекЭлемент Из Метаданные.Перечисления["ГрафикиРаботы"].ЗначенияПеречисления  Цикл
			Если ТекЭлемент.Синоним = ПодходящийГрафикРаботы Тогда
				СтрокаТЧ.ГрафикРаботы = Перечисления["ГрафикиРаботы"][ТекЭлемент.Имя];
				Прервать;
			КонецЕсли;
		КонецЦикла;			
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнениеТЧПодходящиеТипыЗанятости(ДанныеЗаполнения)

	СписокПодходящихТиповЗанятости = ДанныеЗаполнения.ПодходящиеТипыЗанятости;
	
	Для Каждого ТипЗанятости Из СписокПодходящихТиповЗанятости Цикл
		СтрокаТЧ = ПодходящиеТипыЗанятости.Добавить();
		ПодходящийТипЗанятости = ТипЗанятости["name"];
		Для каждого ТекЭлемент Из Метаданные.Перечисления["ТипыЗанятости"].ЗначенияПеречисления  Цикл
			Если ТекЭлемент.Синоним = ПодходящийТипЗанятости Тогда
				СтрокаТЧ.ТипЗанятости = Перечисления["ТипыЗанятости"][ТекЭлемент.Имя];
				Прервать;
			КонецЕсли;
		КонецЦикла;			
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнениеТЧКлючевыеНавыки(ДанныеЗаполнения)
	
	СписокНавыков = ДанныеЗаполнения.КлючевыеНавыки;	
	Для Каждого Навык Из СписокНавыков Цикл		
		СтрокаТЧ = КлючевыеНавыки.Добавить();
		СтрокаТЧ.Навык = Навык; 		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнениеДанныхКандидатаССайта(ДанныеЗаполнения)
		
	СсылкаНаГород = Справочники.Города.НайтиПоНаименованию(ДанныеЗаполнения.Город);
	Если НЕ СсылкаНаГород.Пустая() Тогда
		Регион = СсылкаНаГород.Родитель;
		Город = СсылкаНаГород;
	КонецЕсли; 
	
	СсылкаНаМетро = Справочники.СтанцииМетро.НайтиПоНаименованию(ДанныеЗаполнения.СтанцияМетро); 
	Если НЕ СсылкаНаМетро.Пустая() Тогда
		СтанцияМетро = СсылкаНаМетро;
	КонецЕсли;
	Образование = Перечисления.УровниОбразования[СтрЗаменить(ТРег(ДанныеЗаполнения.Образование)," ","")];
	НаименованиеВакансии = ДанныеЗаполнения.СсылкаНаВакансию.НаименованиеВакансии;
	Если ДанныеЗаполнения.Свойство("ДвоичныеДанныеФайла") Тогда
		ФотоКандидата = ПоместитьВоВременноеХранилище(ДанныеЗаполнения.ДвоичныеДанныеФайла);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнениеДанныхОбОбразовании(ДанныеЗаполнения)
	
	СписокКурсов = ДанныеЗаполнения.ОбразованиеСоискателя["additional"];
	СписокТестов = ДанныеЗаполнения.ОбразованиеСоискателя["attestation"];
	СписокСреднегоОбразования = ДанныеЗаполнения.ОбразованиеСоискателя["elementary"];
	СписокВысшегоОбразования = ДанныеЗаполнения.ОбразованиеСоискателя["primary"];
		
	Для Каждого Курс Из СписокКурсов Цикл
		НоваяСтрока = КурсыПовышенияКвалификации.Добавить();
		НоваяСтрока.НазваниеКурсаТеста = Курс["name"];
		НоваяСтрока.Организация = Курс["organization"];
		НоваяСтрока.СпециальностьСпециализация = Курс["result"];
		НоваяСтрока.ГодОкончания = Курс["year"];
	КонецЦикла;
	
	Для Каждого Тест Из СписокТестов Цикл
		НоваяСтрока = ПройденныеТестыИлиЭкзамены.Добавить();
		НоваяСтрока.НазваниеКурсаТеста = Тест["name"];
		НоваяСтрока.Организация = Тест["organization"];
		НоваяСтрока.СпециальностьСпециализация = Тест["result"];
		НоваяСтрока.ГодОкончания = Тест["year"];
	КонецЦикла;
	
	Для Каждого Элемент Из СписокСреднегоОбразования Цикл
		НоваяСтрока = СреднееОбразование.Добавить();
		НоваяСтрока.НазваниеУчебногоЗаведения = Элемент["name"];
		НоваяСтрока.ГодОкончания = Элемент["year"];
	КонецЦикла;
	
	Для Каждого Элемент Из СписокВысшегоОбразования Цикл
		НоваяСтрока = ОбразованиеВышеСреднего.Добавить();		
		Для каждого ТекЭлемент Из Метаданные.Перечисления["УровниОбразования"].ЗначенияПеречисления Цикл
			Если ТекЭлемент.Синоним = Элемент["education_level"]["name"] Тогда
				НоваяСтрока.УровеньОбразования = Перечисления["УровниОбразования"][ТекЭлемент.Имя];
				Прервать;
			КонецЕсли;
		КонецЦикла;		
		НоваяСтрока.НазваниеУчебногоЗаведения = Элемент["name"];
		НоваяСтрока.Факультет = Элемент["organization"];
		НоваяСтрока.СпециальностьСпециализация = Элемент["result"];
		НоваяСтрока.АкронимУчебногоЗаведения = Элемент["university_acronym"];
		НоваяСтрока.ГодОкончания = Элемент["year"];
	КонецЦикла;	

КонецПроцедуры
